doc/manual.org
Lisp on Lines : The Missing Manual.

/Abstract/: Lisp on Lines is a Common Lisp based framework for rapid
development of data-driven applications. It is particularly useful
for producing Web based applications, but is also useful elsewhere.


* Introduction

Lisp on Lines (LoL) is a framework for rapid development of data-driven
applications, with a particular focus on web-based applications. It
builds on the UncommonWeb engine and Contextl, and uses CLOS and the
MOP extensively. Most of LoL can be used both at the REPL and through
the browser, offering many options for development and testing.

While the target audience for LoL is developers experienced with both
web technologies and common lisp, a good programmer with a little
experience in either should be able to pick things up fairly quickly.

* Installation

LoL has a load of dependencies, which themselves depend on others,
etc. The best way to deal with this is to use [[http://common-lisp.net/project/clbuild/][clbuild]], a library
management tool.

If you'd prefer to manage your libraries manually, the dependencies,
according to clbuild, are :

alexandria arnesi bordeaux-threads cl-base64 cl-fad cl-mime cl-ppcre
cl-qprint closer-mop contextl iterate lift local-time lw-compat
net-telent-date parenscript parse-number portable-threads puri rfc2109
slime split-sequence trivial-garbage ucw usocket yaclml

All libraries should be installed from version control where available.

* Describing the domain with the MAO protocol.

  LoL uses a protocol it calls Meta-Attributed Objects, or MAO, as the
  basis of its display mechanism. In MAO, we create context-aware
  DESCRIPTIONs of objects, and those descriptions are used to generate
  the display of the object itself. By having these external
  descriptions change based on the context in which they are used, a few
  generic components can come together to create complex interfaces.

** Descriptions
  Descriptions are a similar conceptually to classes. Every Lisp object
  has one, and the root description that all descriptions inherit from
  is known as T. FIND-DESCRIPTION is used to, well, find descriptions.
  
#+BEGIN_SRC lisp 
  (find-description t) 
  => #<DESCRIPTION T {B7B9861}>
#+END_SRC

** Attributes and Properties
  A description is a collection of ATTRIBUTEs, among other things. Each
  attribute describes a part of an object, and any number of attributes
  may or may not be active. The ATTRIBUTES function is used to find a
  the list attributes that are both active and applicable in the current
  context.

#+BEGIN_SRC lisp 
(attributes (find-description t))
=>(#<ATTRIBUTE IDENTITY {BBC9691}> 
   #<ATTRIBUTE TYPE {BBC96A1}>
   #<ATTRIBUTE CLASS {BBC96B1}>)
#+END_SRC

The functions DESCRIPTION-ATTRIBUTES, DESCRIPTION-ACTIVE-ATTRIBUTES
and DESCRIPTION-CURRENT-ATTRIBUTES return all the descriptions
attributes, Attributes that are currently active regardless of
context, and attributes that exist in the current context but may or
may not be active, respectively.

Attributes have properties, for example ATTRIBUTE-LABEL and
ATTRIBUTE-VALUE.  By simply iterating through the attributes of a
described object, we can create a generic display for any lisp
object. This is very similar, and was inspired by the technique
outlined by Adrian Lienhard in [[http://www.adrian-lienhard.ch/files/mewa.pdf][MEWA: A Meta-level Architecture for
Generic Web-Application Construction_]].


For attribute properties to be useful, the description must be
associated with the object it is meant to describe.

The function FUNCALL-WITH-DESCRIBED-OBJECT takes care of setting up
the proper context. There is some syntax for it in the form of
WITH-DESCRIBED-OBJECT :

#+BEGIN_SRC lisp

(let ((description (find-description t))
	   (object "Hello World"))
       (with-described-object (object description)
	 (dolist (a (attributes description))
	   (format t "~@[~A: ~]~A~%" 
		   (attribute-label a)
		   (attribute-value a)))))
=>
Hello World
Type: (SIMPLE-ARRAY CHARACTER (11))
Class: #<BUILT-IN-CLASS SB-KERNEL::SIMPLE-CHARACTER-STRING>

NIL
#+END_SRC

FUNCALL-WITH-DESCRIBED-OBJECT binds two specials, *DESCRIPTION* and
*OBJECT*, to its arguments. Knowing this, we can shorten our code
somewhat. Later on we'll be far away from the lexical bindings of
description and object, so these special variables are essential.

Another reason for the *description* variable is that
WITH-DESCRIBED-OBJECT will use DESCRIPTION-OF to determine the
description if the DESCRIPTION argument is NIL

#+BEGIN_SRC lisp
(with-described-object ("Hello World" nil)
  (dolist (a (attributes *description*))
    (format t "~@[~A: ~]~A~%" 
            (attribute-label a)
	    (attribute-value a))))

Lets wrap that up in a function that we can re-use. LoL includes an
entire DISPLAY mechanism that is slightly more involved, but this
serves as an excellent example with not bogging us down in details.

#+BEGIN_SRC lisp
(defun present (object &optional description) 
  (with-described-object (object description)
    (dolist (a (attributes *description*))
      (format t "~@[~A: ~]~A~%" 
	      (attribute-label a)
	      (attribute-value a)))))
#+END_SRC

