doc/manual.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Lisp on Lines : The Missing Manual.</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009/07/27 01:46:25 PM"/>
<meta name="author" content="Drew Crampsie"/>
</head><body>
<h1 class="title">Lisp on Lines : The Missing Manual.</h1>
<i>Abstract</i>: Lisp on Lines is a Common Lisp based framework for rapid
development of data-driven applications. It is particularly useful
for producing Web based applications, but is also useful elsewhere.



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Installation</a></li>
<li><a href="#sec-3">3 Describing the domain with the MAO protocol.</a>
<ul>
<li><a href="#sec-3.1">3.1 Descriptions</a></li>
<li><a href="#sec-3.2">3.2 Attributes and Properties</a></li>
<li><a href="#sec-3.3">3.3 Contexts</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Defining and Using Descriptions</a>
<ul>
<li><a href="#sec-4.1">4.1 Defining a simple description </a></li>
<li><a href="#sec-4.2">4.2 Using descriptions as and with contexts.</a></li>
<li><a href="#sec-4.3">4.3 T : The root of all descriptions.</a></li>
<li><a href="#sec-4.4">4.4 DESCRIPTION-OF : Permanently Associate a description with a class.</a></li>
</ul>
</li>
<li><a href="#sec-5">5 The DISPLAY Protocol</a></li>
<li><a href="#sec-6">6 Automatic Descriptions for CLOS classes.</a>
<ul>
<li><a href="#sec-6.1">6.1 Described CLOS objects an the EDITABLE description</a></li>
<li><a href="#sec-6.2">6.2 Extending the generated description</a></li>
</ul>
</li>
<li><a href="#sec-7">7 Using Lisp-on-Lines for the Web.</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Introduction</h2>
<div id="text-1">


<p>
Lisp on Lines (LoL) is a framework for rapid development of data-driven
applications, with a particular focus on web-based applications. It
builds on the UncommonWeb engine and Contextl, and uses CLOS and the
MOP extensively. Most of LoL can be used both at the REPL and through
the browser, offering many options for development and testing.
</p>
<p>
While the target audience for LoL is developers experienced with both
web technologies and common lisp, a good programmer with a little
experience in either should be able to pick things up fairly quickly.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Installation</h2>
<div id="text-2">


<p>
LoL has a load of dependencies, which themselves depend on others,
etc. The best way to deal with this is to use <a href="http://common-lisp.net/project/clbuild/">clbuild</a>, a library
management tool.
</p>
<p>
If you'd prefer to manage your libraries manually, the dependencies,
according to clbuild, are :
</p>
<p>
alexandria arnesi bordeaux-threads cl-base64 cl-fad cl-mime cl-ppcre
cl-qprint closer-mop contextl iterate lift local-time lw-compat
net-telent-date parenscript parse-number portable-threads puri rfc2109
slime split-sequence trivial-garbage ucw usocket yaclml
</p>
<p>
All libraries should be installed from version control where available.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 Describing the domain with the MAO protocol.</h2>
<div id="text-3">


<p>
LoL uses a protocol it calls Meta-Attributed Objects, or MAO, as the
basis of its display mechanism. In MAO, we create context-aware
DESCRIPTIONs of objects, and those descriptions are used to generate
the display of the object itself. By having these external
descriptions change based on the context in which they are used, a few
generic components can come together to create complex interfaces.
</p>

</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1">3.1 Descriptions</h3>
<div id="text-3.1">

<p>Descriptions are a similar conceptually to classes. Every Lisp object
has one, and the root description that all descriptions inherit from
is known as T. FIND-DESCRIPTION is used to, well, find descriptions.
</p>


<pre class="src">  (find-description t) 
  =&gt; #&lt;DESCRIPTION T {B7B9861}&gt;
</pre>


</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2">3.2 Attributes and Properties</h3>
<div id="text-3.2">

<p>A description is a collection of ATTRIBUTEs, among other things. Each
attribute describes a part of an object, and any number of attributes
may or may not be active. The ATTRIBUTES function is used to find a
the list attributes that are both active and applicable in the current
context.
</p>


<pre class="src">(attributes (find-description t))
=&gt;(#&lt;ATTRIBUTE IDENTITY {BBC9691}&gt; 
   #&lt;ATTRIBUTE TYPE {BBC96A1}&gt;
   #&lt;ATTRIBUTE CLASS {BBC96B1}&gt;)
</pre>


<p>
The functions DESCRIPTION-ATTRIBUTES, DESCRIPTION-ACTIVE-ATTRIBUTES
and DESCRIPTION-CURRENT-ATTRIBUTES return all the descriptions
attributes, Attributes that are currently active regardless of
context, and attributes that exist in the current context but may or
may not be active, respectively.
</p>
<p>
Attributes have properties, for example ATTRIBUTE-LABEL and
ATTRIBUTE-VALUE.  By simply iterating through the attributes of a
described object, we can create a generic display for any lisp
object. This is very similar, and was inspired by the technique
outlined by Adrian Lienhard in <a href="http://www.adrian-lienhard.ch/files/mewa.pdf">MEWA: A Meta-level Architecture for Generic Web-Application Construction_</a>.
</p>

<p>
For attribute properties to be useful, the description must be
associated with the object it is meant to describe.
</p>
<p>
The function FUNCALL-WITH-DESCRIBED-OBJECT takes care of setting up
the proper context. There is some syntax for it in the form of
WITH-DESCRIBED-OBJECT :
</p>


<pre class="src">
(<span style="color: #a020f0;">let</span> ((description (find-description t))
           (object <span style="color: #bc8f8f;">"Hello World"</span>))
       (<span style="color: #a020f0;">with-described-object</span> (object description)
         (<span style="color: #a020f0;">dolist</span> (a (attributes description))
           (format t <span style="color: #bc8f8f;">"~@[~A: ~]~A~%"</span> 
                   (attribute-label a)
                   (attribute-value a)))))
=&gt;
Hello World
Type: (SIMPLE-ARRAY CHARACTER (11))
Class: #&lt;BUILT-IN-CLASS SB-KERNEL::SIMPLE-CHARACTER-STRING&gt;

NIL
</pre>


<p>
FUNCALL-WITH-DESCRIBED-OBJECT binds two specials, <b>DESCRIPTION</b> and
<b>OBJECT</b>, to its arguments. Knowing this, we can shorten our code
somewhat. Later on we'll be far away from the lexical bindings of
description and object, so these special variables are essential.
</p>
<p>
Another reason for the <b>description</b> variable is that
WITH-DESCRIBED-OBJECT will use DESCRIPTION-OF to determine the
description if the DESCRIPTION argument is NIL
</p>


<pre class="src">(<span style="color: #a020f0;">with-described-object</span> (<span style="color: #bc8f8f;">"Hello World"</span> nil)
  (<span style="color: #a020f0;">dolist</span> (a (attributes *description*))
    (format t <span style="color: #bc8f8f;">"~@[~A: ~]~A~%"</span> 
            (attribute-label a)
            (attribute-value a))))

Lets wrap that up in a function that we can re-use. LoL includes an
entire DISPLAY mechanism that is slightly more involved, but this
serves as an excellent example with not bogging us down in details.

<span style="color: #b22222;">#+BEGIN_SRC lisp</span>
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">present</span> (object <span style="color: #228b22;">&amp;optional</span> description) 
  (<span style="color: #a020f0;">with-described-object</span> (object description)
    (<span style="color: #a020f0;">dolist</span> (a (attributes *description*))
      (format t <span style="color: #bc8f8f;">"~@[~A: ~]~A~%"</span> 
              (attribute-label a)
              (attribute-value a)))))
</pre>


</div>

</div>
