doc/manual.org
** Contexts

MAO adds to MEWA the concept of dynamic context. By changing the
context in which an object is described, we combine and specialize the
generic displays, ultimately creating different views of our
objects. LoL uses ContextL extensively. Descriptions are contextl
layers, and attributes themselves are layered classes. Most of the
exported functions are layered methods, and the idea of dynamic
context-sensitivity is used throughout LoL. If you're not familiar
with contextl, don't worry, LoL mostly stands on its own. Still,
reading through the material on contextl won't hurt.

Descriptions may have different attributes dependant on what
description contexts (or layers) are currently active. Attributes
themselves might have different properties.
 
When an object is being described (using WITH-DESCRIBED-OBJECT), it is
also activated as a layer context. One can also activate/deactivate
contexts manually, using WITH-ACTIVE-DESCRIPTIONS and 
WITH-INACTIVE-DESCRIPTIONS.

Hopefully a little code will make this more clear :

#+BEGIN_SRC lisp
(present "Hello World")
=>
Hello World
Type: (SIMPLE-ARRAY CHARACTER (11))
Class: #<BUILT-IN-CLASS SB-KERNEL::SIMPLE-CHARACTER-STRING>
Simple character string

;; Now we'll activate a built-in description, INLINE.

(with-active-descriptions (inline)
  (present "Hello World"))
=>
Hello World
#+END_SRC

You can see that the behavior of PRESENT changed when the INLINE
context was activated. This is the key innovation that makes LoL so
useful. In the next chapter we'll create our own descriptions and
demonstrate this further.

* Defining and Using Descriptions

** Defining a simple description 
The basics of the MAO should now (hopefully) be clear, so lets start
using it. First, we'll create our very own description.

#+BEGIN_SRC lisp
(define-description hello-world ()
  ((title :value "Lisp on Lines Demo")
   (identity :label "Message")
   (length :label "Length" :function #'length)
   (active-attributes :value '(title identity length))))
#+END_SRC

Descriptions are defined very much like CLOS classes, and are in fact
implemented that way, inheritance rules apply. The object returned
from FIND-DESCRIPTION is best described as a prototype-based
singleton. In other words, there is only one instance, and it inherits
attributes and properties from further up its hierarchy unless
specifically overridden.

Attributes can have any number of properties, (see the class
STANDARD-ATTRIBUTE), but the three most important are accessed via the
methods ATTRIBUTE-LABEL, ATTRIBUTE-VALUE and ATTRIBUTE-FUNCTION,and
named (in DEFINE-DESCRIPTION forms and elsewhere) 
by the :label, :value, and :function keywords. 

ATTRIBUTE-LABEL is simply a textual label that describes the
attribute. ATTRIBUTE-VALUE is defined to return the result of calling
ATTRIBUTE-FUNCTION with the object as its argument. If
ATTRIBUTE-FUNCTION is NIL, the value of the :value property is returned
directly.

In the example above, the IDENTITY and ACTIVE-ATTRIBUTES attributes
are inherited from T, and we are simply overriding the default
properties for our description. LENGTH and TITLE are specific to this
description. A look at src/standard-descriptions/t.lisp may be
instructive at this point.

Now, we can present our object using our new description.

#+BEGIN_SRC lisp 
(present "Hello World" (find-description 'hello-world))
=>
Lisp on Lines Demo
Message: Hello World
Length: 11

NIL
#+END_SRC

** Using descriptions as and with contexts.

A we mentioned earlier, when an object is being described, the
'description context' is also made active. On top of that, one can
define partial descriptions that are only active when other
description contexts have been activated.

We'll make a ONE-LINE description similar to the INLINE description
demonstrated earlier.

#+BEGIN_SRC lisp
(define-description one-line ())

(define-description hello-world ()
  ((identity :label nil)
   (active-attributes :value '(identity)))
  (:in-description one-line))

#+END_SRC

Here we've defined a new description, ONE-LINE, and a
context-sensitive extension to our HELLO-WORLD description. This
partial desription will be active only when in the context of a
one-line description. One can have attributes that only exist in
certain description contexts, and attributes can have different
properties. 

#+BEGIN_SRC lisp
(let ((message "Hello World!")
      (description (find-description 'hello-world)))
  (print :normal)(terpri)
  (present message description)       
  (print :one-line)(terpri)
  (with-active-descriptions (one-line)
    (present message description)))
=>
:NORMAL 
Lisp on Lines Demo
Message: Hello World!
Length: 12

:ONE-LINE 
Hello World!

NIL
#+END_SRC

By activating the description ONE-LINE, we've changed the context in
which our object is displayed. We can create any number of
descriptions and contexts and activate/deactivate them in any order.

Descriptions are implemented as ContextL 'layers', so if all
this seems weird, reading the ContextL papers might help.

** T : The root of all descriptions.

Because all descriptions inherit from T, we can define contexts for T
and they will apply to every description. The INLINE description can
be found in standard-descriptions/inline.lisp, where we define
a desription for T in the context of the INLINE description :

#+BEGIN_SRC lisp
;; Defined by LoL in inline.lisp :
(define-description t ()
  ((identity :label nil)
   (active-attributes :value '(identity))
   (attribute-delimiter :value ", ")
   (label-formatter :value (curry #'format nil "~A: "))
   (value-formatter :value (curry #'format nil "~A")))
  (:in-description inline))}

#+END_SRC

The does for the LoL DISPLAY mechanism what ONE-LINE did for PRESENT,
only with more magic. By exetending T in this way, it's easy to create
contexts the redefine the behavior of LoL while still reusing the basics.

** DESCRIPTION-OF : Permanently Associate a description with a class.

The LAYERED-FUNCTION DESCRIPTION-OF will return the description
associated with an object. 

#+BEGIN_SRC lisp

(description-of nil)
=>
#<DESCRIPTION NULL {AA04F49}>

(description-of t)
=>
#<DESCRIPTION SYMBOL {AA04541}>

(description-of '(1 2 3))
=>
#<DESCRIPTION CONS {AA04C29}>

;;etc

#+END_SRC

