doc/manual.html

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3">3.3 Contexts</h3>
<div id="text-3.3">


<p>
MAO adds to MEWA the concept of dynamic context. By changing the
context in which an object is described, we combine and specialize the
generic displays, ultimately creating different views of our
objects. LoL uses ContextL extensively. Descriptions are contextl
layers, and attributes themselves are layered classes. Most of the
exported functions are layered methods, and the idea of dynamic
context-sensitivity is used throughout LoL. If you're not familiar
with contextl, don't worry, LoL mostly stands on its own. Still,
reading through the material on contextl won't hurt.
</p>
<p>
Descriptions may have different attributes dependant on what
description contexts (or layers) are currently active. Attributes
themselves might have different properties.
</p>
<p>
When an object is being described (using WITH-DESCRIBED-OBJECT), it is
also activated as a layer context. One can also activate/deactivate
contexts manually, using WITH-ACTIVE-DESCRIPTIONS and 
WITH-INACTIVE-DESCRIPTIONS.
</p>
<p>
Hopefully a little code will make this more clear :
</p>


<pre class="src">(present <span style="color: #bc8f8f;">"Hello World"</span>)
=&gt;
Hello World
Type: (SIMPLE-ARRAY CHARACTER (11))
Class: #&lt;BUILT-IN-CLASS SB-KERNEL::SIMPLE-CHARACTER-STRING&gt;
Simple character string

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Now we'll activate a built-in description, INLINE.
</span>
(<span style="color: #a020f0;">with-active-descriptions</span> (<span style="color: #a020f0;">inline</span>)
  (present <span style="color: #bc8f8f;">"Hello World"</span>))
=&gt;
Hello World
</pre>


<p>
You can see that the behavior of PRESENT changed when the INLINE
context was activated. This is the key innovation that makes LoL so
useful. In the next chapter we'll create our own descriptions and
demonstrate this further.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">4 Defining and Using Descriptions</h2>
<div id="text-4">



</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1">4.1 Defining a simple description </h3>
<div id="text-4.1">

<p>The basics of the MAO should now (hopefully) be clear, so lets start
using it. First, we'll create our very own description.
</p>


<pre class="src">(<span style="color: #a020f0;">define-description</span> hello-world ()
  ((title <span style="color: #da70d6;">:value</span> <span style="color: #bc8f8f;">"Lisp on Lines Demo"</span>)
   (identity <span style="color: #da70d6;">:label</span> <span style="color: #bc8f8f;">"Message"</span>)
   (length <span style="color: #da70d6;">:label</span> <span style="color: #bc8f8f;">"Length"</span> <span style="color: #da70d6;">:function</span> #'length)
   (active-attributes <span style="color: #da70d6;">:value</span> '(title identity length))))
</pre>


<p>
Descriptions are defined very much like CLOS classes, and are in fact
implemented that way, inheritance rules apply. The object returned
from FIND-DESCRIPTION is best described as a prototype-based
singleton. In other words, there is only one instance, and it inherits
attributes and properties from further up its hierarchy unless
specifically overridden.
</p>
<p>
Attributes can have any number of properties, (see the class
STANDARD-ATTRIBUTE), but the three most important are accessed via the
methods ATTRIBUTE-LABEL, ATTRIBUTE-VALUE and ATTRIBUTE-FUNCTION,and
named (in DEFINE-DESCRIPTION forms and elsewhere) 
by the :label, :value, and :function keywords. 
</p>
<p>
ATTRIBUTE-LABEL is simply a textual label that describes the
attribute. ATTRIBUTE-VALUE is defined to return the result of calling
ATTRIBUTE-FUNCTION with the object as its argument. If
ATTRIBUTE-FUNCTION is NIL, the value of the :value property is returned
directly.
</p>
<p>
In the example above, the IDENTITY and ACTIVE-ATTRIBUTES attributes
are inherited from T, and we are simply overriding the default
properties for our description. LENGTH and TITLE are specific to this
description. A look at src/standard-descriptions/t.lisp may be
instructive at this point.
</p>
<p>
Now, we can present our object using our new description.
</p>


<pre class="src">(present <span style="color: #bc8f8f;">"Hello World"</span> (find-description 'hello-world))
=&gt;
Lisp on Lines Demo
Message: Hello World
Length: 11

NIL
</pre>


</div>

</div>

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2">4.2 Using descriptions as and with contexts.</h3>
<div id="text-4.2">


<p>
A we mentioned earlier, when an object is being described, the
'description context' is also made active. On top of that, one can
define partial descriptions that are only active when other
description contexts have been activated.
</p>
<p>
We'll make a ONE-LINE description similar to the INLINE description
demonstrated earlier.
</p>


<pre class="src">(<span style="color: #a020f0;">define-description</span> one-line ())

(<span style="color: #a020f0;">define-description</span> hello-world ()
  ((identity <span style="color: #da70d6;">:label</span> nil)
   (active-attributes <span style="color: #da70d6;">:value</span> '(identity)))
  (<span style="color: #da70d6;">:in-description</span> one-line))

</pre>


<p>
Here we've defined a new description, ONE-LINE, and a
context-sensitive extension to our HELLO-WORLD description. This
partial desription will be active only when in the context of a
one-line description. One can have attributes that only exist in
certain description contexts, and attributes can have different
properties. 
</p>


<pre class="src">(<span style="color: #a020f0;">let</span> ((message <span style="color: #bc8f8f;">"Hello World!"</span>)
      (description (find-description 'hello-world)))
  (print <span style="color: #da70d6;">:normal</span>)(terpri)
  (present message description)       
  (print <span style="color: #da70d6;">:one-line</span>)(terpri)
  (<span style="color: #a020f0;">with-active-descriptions</span> (one-line)
    (present message description)))
=&gt;
<span style="color: #da70d6;">:NORMAL</span> 
Lisp on Lines Demo
Message: Hello World!
Length: 12

<span style="color: #da70d6;">:ONE-LINE</span> 
Hello World!

NIL
</pre>


<p>
By activating the description ONE-LINE, we've changed the context in
which our object is displayed. We can create any number of
descriptions and contexts and activate/deactivate them in any order.
</p>
<p>
Descriptions are implemented as ContextL 'layers', so if all
this seems weird, reading the ContextL papers might help.
</p>
</div>

</div>

<div id="outline-container-4.3" class="outline-3">
<h3 id="sec-4.3">4.3 T : The root of all descriptions.</h3>
<div id="text-4.3">


<p>
Because all descriptions inherit from T, we can define contexts for T
and they will apply to every description. The INLINE description can
be found in standard-descriptions/inline.lisp, where we define
a desription for T in the context of the INLINE description :
</p>


<pre class="src"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Defined by LoL in inline.lisp :
</span>(<span style="color: #a020f0;">define-description</span> t ()
  ((identity <span style="color: #da70d6;">:label</span> nil)
   (active-attributes <span style="color: #da70d6;">:value</span> '(identity))
   (attribute-delimiter <span style="color: #da70d6;">:value</span> <span style="color: #bc8f8f;">", "</span>)
   (label-formatter <span style="color: #da70d6;">:value</span> (curry #'format nil <span style="color: #bc8f8f;">"~A: "</span>))
   (value-formatter <span style="color: #da70d6;">:value</span> (curry #'format nil <span style="color: #bc8f8f;">"~A"</span>)))
  (<span style="color: #da70d6;">:in-description</span> inline))}

</pre>


<p>
The does for the LoL DISPLAY mechanism what ONE-LINE did for PRESENT,
only with more magic. By exetending T in this way, it's easy to create
contexts the redefine the behavior of LoL while still reusing the basics.
</p>
</div>

</div>

<div id="outline-container-4.4" class="outline-3">
<h3 id="sec-4.4">4.4 DESCRIPTION-OF : Permanently Associate a description with a class.</h3>
<div id="text-4.4">


<p>
The LAYERED-FUNCTION DESCRIPTION-OF will return the description
associated with an object. 
</p>


<pre class="src">
(description-of nil)
=&gt;
#&lt;DESCRIPTION NULL {AA04F49}&gt;

(description-of t)
=&gt;
#&lt;DESCRIPTION SYMBOL {AA04541}&gt;

(description-of '(1 2 3))
=&gt;
#&lt;DESCRIPTION CONS {AA04C29}&gt;

<span style="color: #b22222;">;;</span><span style="color: #b22222;">etc
</span>
</pre>


</div>
</div>

</div>
