doc/manual.org
* The DISPLAY Protocol

  Our function, PRESENT, is very basic, though pretty powerful when
  combined with descriptions and contexts. LoL includes a superset of
  such functionality built-in.
  
  The main entry point into this protocol is the DISPLAY
  function. The signature for this functions is :
  
#+BEGIN_SRC lisp
(display DISPLAY OBJECT &REST ARGS &KEY DEACTIVATE ACTIVATE &ALLOW-OTHER-KEYS)
#+END_SRC
  
  The first argument, DISPLAY, is the place where we will display
  to/on/in/with. It could be a stream, a UCW component, a CLIM gadget,
  or anything else you might want to use.

  One can specialize on this argument (though it's better to specialize
  DISPLAY-USING-DESCRIPTION... more on that later) to use generic
  descriptions to display objects in different environments.
  
  The second argument is simply the object to be displayed. Here's a
  simple example :
  
#+BEGIN_SRC lisp
(display t t)
=>
T
Type:BOOLEAN
Class:#<BUILT-IN-CLASS SYMBOL>
Symbol
Name:T
Value:T
Package:#<PACKAGE "COMMON-LISP">
Function:<UNBOUND>
; No value
#+END_SRC

   The two arguments specified in the lambda-list, ACTIVATE and
   DEACTIVATE, are used to activate and deactivate description contexts in
   the scope of the display function. 

#+BEGIN_SRC lisp

(display nil t :activate '(inline))
=> 
"t"
(with-active-descriptions (inline) 
 (display nil t :deactivate '(inline))) 
=>
"T
Type:BOOLEAN
Class:#<BUILT-IN-CLASS SYMBOL>
Symbol
Name:T
Value:T
Package:#<PACKAGE \"COMMON-LISP\">
Function:<UNBOUND>"

#+END_SRC

Any other keyword arguments passed will be used to set the value of an
attribute with a :keyword property, in the dynamic context of the
DISPLAY function call. Once such attribute, and a very useful one is
ACTIVE-ATTRIBUTES with its :attributes keyword :

#+BEGIN_SRC lisp

(display t t :attributes '(class package))
=>
Class:#<BUILT-IN-CLASS SYMBOL>
Package:#<PACKAGE "COMMON-LISP">

#+END_SRC

The properties of attributes that do not have a :keyword property can
also be set dynamically. Since :attributes is the :keyword property of
the ACTIVE-ATTRIBUTES attribute, the following form is equivalent to
the previous :

#+BEGIN_SRC lisp
(display t t  :attributes '((active-attributes 
			     :value (class package))))
=>
Class:#<BUILT-IN-CLASS SYMBOL>
Package:#<PACKAGE "COMMON-LISP">
#+END_SRC

Setting the attributes this way is almost like creating an anonymous
description context... you can express just about anything you would
in a DEFINE-DESCRIPTION. Here's a more involved example :

#+BEGIN_SRC lisp
(display t t  :attributes `((identity :label "The Object") 
			    (class :label "CLOS Class")
			    (package :value "COMMON LISP" :function nil)
			    (type :value-formatter 
				  ,(lambda (a)
				    (format nil "Got a value? ~A" a)))))
=>
				 
The Object:T
CLOS Class:#<BUILT-IN-CLASS SYMBOL>
Package:COMMON LISP
Type:Got a value? BOOLEAN

#+END_SRC

I hope that serves well to demonstrate the concepts behind LoL, as
there is no API documentation available at the moment... use the
source luke!


* Automatic Descriptions for CLOS classes.

  Lisp-on-Lines includes a compose-able metaclass, DESCRIBED-CLASS. It
  can be combined with _any_ other metaclass without affecting the
  behavior of that class. DESCRIBED-CLASS has been used with the
  metaclasses provided by CLSQL, ROFL, Rucksack and UCW simply by
  defining a class that inherits from both metaclasses.

  DESCRIBED-CLASS creates a base description for the class, named
  DESCRIPTION-FOR-<class>, and another description with the same name
  as the class that has the previous description as a superclass. The
  then defines a method on DESCRIPTION-OF that returns the second
  description.

  LoL includes DESCRIBED-STANDARD-CLASS, which is subclass of
  STANDARD-CLASS and DESCRIBED-CLASS. We'll use this to create a class
  and its description.

#+BEGIN_SRC lisp

(defclass person ()
  (first-name last-name company-name 
   date-of-birth phone fax email 
   address city province postal-code)
  (:metaclass described-standard-class))
=>
#<DESCRIBED-STANDARD-CLASS PERSON>

(display t (make-instance 'person))
=>
First name:#<UNBOUND>
Last name:#<UNBOUND>
Company name:#<UNBOUND>
Date of birth:#<UNBOUND>
Phone:#<UNBOUND>
Fax:#<UNBOUND>
Email:#<UNBOUND>
Address:#<UNBOUND>
City:#<UNBOUND>
Province:#<UNBOUND>
Postal code:#<UNBOUND>

#+END_SRC

** Described CLOS objects an the EDITABLE description

   The slots of an object are SETF'able places, and LoL takes
   advantage of that to provide EDITABLE descriptions
   automatically. When the EDITABLE description is active, and editor
   will be presented. The REPL based editor is pretty basic, but still
   useful. The HTML based editor will be described later.


#+BEGIN_SRC lisp
(defun edit-object (object &rest args)
  (with-active-descriptions (editable)
    (apply #'display t object args)))

(let ((object (make-instance 'person)))
  (edit-object object)
  (terpri)
  (display t object))

;; What follows are prompts and the information i entered
       
First name:Drew

Last name:Crampsie

Company name:The Tech Co-op

Date of birth:1978-07-31

Phone:555-5555

Fax:555-5555

Email:drewc@tech.coop

Address:s/v Kanu, Lower Fraser River

City:Richmond

Province:BC

Postal code:V1V3T6

;; And this is what was displayed.

First name:Drew
Last name:Crampsie
Company name:The Tech Co-op
Date of birth:1978-07-31
Phone:555-5555
Fax:555-5555
Email:drewc@tech.coop
Address:s/v Kanu, Lower Fraser River
City:Richmond
Province:BC
Postal code:V1V3T6
#+END_SRC

** Extending the generated description

We mentioned earlier that DESCRIBED-CLASS creates two descriptions :

#+BEGIN_SRC lisp

(find-description 'description-for-person)
=>
#<DESCRIPTION DESCRIPTION-FOR-PERSON {D296DE1}>

(find-description 'person)
=>
#<DESCRIPTION PERSON {ADFEDB1}>

(description-of (make-instance 'person))
=>
#<DESCRIPTION PERSON {ADFEDB1}>

#+END_SRC


The reason for this is so we can redefine the description PERSON while
keeping all the generated information from DESCRIPTION-FOR-PERSON.

In this case, we will  add an attribute, PERSON-AGE, that calculates
a persons age based on the data in the date-of-birth slot.









  



