doc/manual.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">5 The DISPLAY Protocol</h2>
<div id="text-5">


<p>
Our function, PRESENT, is very basic, though pretty powerful when
combined with descriptions and contexts. LoL includes a superset of
such functionality built-in.
</p>
<p>
The main entry point into this protocol is the DISPLAY
function. The signature for this functions is :
</p>


<pre class="src">(display DISPLAY OBJECT <span style="color: #228b22;">&amp;REST</span> ARGS <span style="color: #228b22;">&amp;KEY</span> DEACTIVATE ACTIVATE <span style="color: #228b22;">&amp;ALLOW-OTHER-KEYS</span>)
</pre>


<p>
The first argument, DISPLAY, is the place where we will display
to/on/in/with. It could be a stream, a UCW component, a CLIM gadget,
or anything else you might want to use.
</p>
<p>
One can specialize on this argument (though it's better to specialize
DISPLAY-USING-DESCRIPTION&hellip; more on that later) to use generic
descriptions to display objects in different environments.
</p>
<p>
The second argument is simply the object to be displayed. Here's a
simple example :
</p>


<pre class="src">(display t t)
=&gt;
T
Type:BOOLEAN
Class:#&lt;BUILT-IN-CLASS SYMBOL&gt;
Symbol
Name:T
Value:T
Package:#&lt;PACKAGE <span style="color: #bc8f8f;">"COMMON-LISP"</span>&gt;
Function:&lt;UNBOUND&gt;
<span style="color: #b22222;">; </span><span style="color: #b22222;">No value
</span></pre>


<p>
The two arguments specified in the lambda-list, ACTIVATE and
DEACTIVATE, are used to activate and deactivate description contexts in
the scope of the display function. 
</p>


<pre class="src">
(display nil t <span style="color: #da70d6;">:activate</span> '(<span style="color: #a020f0;">inline</span>))
=&gt; 
<span style="color: #bc8f8f;">"t"</span>
(<span style="color: #a020f0;">with-active-descriptions</span> (<span style="color: #a020f0;">inline</span>) 
 (display nil t <span style="color: #da70d6;">:deactivate</span> '(<span style="color: #a020f0;">inline</span>))) 
=&gt;
<span style="color: #bc8f8f;">"T
Type:BOOLEAN
Class:#&lt;BUILT-IN-CLASS SYMBOL&gt;
Symbol
Name:T
Value:T
Package:#&lt;PACKAGE \"COMMON-LISP\"&gt;
Function:&lt;UNBOUND&gt;"</span>

</pre>


<p>
Any other keyword arguments passed will be used to set the value of an
attribute with a :keyword property, in the dynamic context of the
DISPLAY function call. Once such attribute, and a very useful one is
ACTIVE-ATTRIBUTES with its :attributes keyword :
</p>


<pre class="src">
(display t t <span style="color: #da70d6;">:attributes</span> '(class package))
=&gt;
Class:#&lt;BUILT-IN-CLASS SYMBOL&gt;
Package:#&lt;PACKAGE <span style="color: #bc8f8f;">"COMMON-LISP"</span>&gt;

</pre>


<p>
The properties of attributes that do not have a :keyword property can
also be set dynamically. Since :attributes is the :keyword property of
the ACTIVE-ATTRIBUTES attribute, the following form is equivalent to
the previous :
</p>


<pre class="src">(display t t  <span style="color: #da70d6;">:attributes</span> '((active-attributes 
                             <span style="color: #da70d6;">:value</span> (class package))))
=&gt;
Class:#&lt;BUILT-IN-CLASS SYMBOL&gt;
Package:#&lt;PACKAGE <span style="color: #bc8f8f;">"COMMON-LISP"</span>&gt;
</pre>


<p>
Setting the attributes this way is almost like creating an anonymous
description context&hellip; you can express just about anything you would
in a DEFINE-DESCRIPTION. Here's a more involved example :
</p>


<pre class="src">(display t t  <span style="color: #da70d6;">:attributes</span> `((identity <span style="color: #da70d6;">:label</span> <span style="color: #bc8f8f;">"The Object"</span>) 
                            (class <span style="color: #da70d6;">:label</span> <span style="color: #bc8f8f;">"CLOS Class"</span>)
                            (package <span style="color: #da70d6;">:value</span> <span style="color: #bc8f8f;">"COMMON LISP"</span> <span style="color: #da70d6;">:function</span> nil)
                            (type <span style="color: #da70d6;">:value-formatter</span> 
                                  ,(<span style="color: #a020f0;">lambda</span> (a)
                                    (format nil <span style="color: #bc8f8f;">"Got a value? ~A"</span> a)))))
=&gt;
                                 
The Object:T
CLOS Class:#&lt;BUILT-IN-CLASS SYMBOL&gt;
Package:COMMON LISP
Type:Got a value? BOOLEAN

</pre>


<p>
I hope that serves well to demonstrate the concepts behind LoL, as
there is no API documentation available at the moment&hellip; use the
source luke!
</p>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">6 Automatic Descriptions for CLOS classes.</h2>
<div id="text-6">


<p>
Lisp-on-Lines includes a compose-able metaclass, DESCRIBED-CLASS. It
can be combined with <u>any</u> other metaclass without affecting the
behavior of that class. DESCRIBED-CLASS has been used with the
metaclasses provided by CLSQL, ROFL, Rucksack and UCW simply by
defining a class that inherits from both metaclasses.
</p>
<p>
DESCRIBED-CLASS creates a base description for the class, named
DESCRIPTION-FOR-&lt;class&gt;, and another description with the same name
as the class that has the previous description as a superclass. The
then defines a method on DESCRIPTION-OF that returns the second
description.
</p>
<p>
LoL includes DESCRIBED-STANDARD-CLASS, which is subclass of
STANDARD-CLASS and DESCRIBED-CLASS. We'll use this to create a class
and its description.
</p>


<pre class="src">
(<span style="color: #a020f0;">defclass</span> <span style="color: #228b22;">person</span> ()
  (first-name last-name company-name 
   date-of-birth phone fax email 
   address city province postal-code)
  (<span style="color: #da70d6;">:metaclass</span> described-standard-class))
=&gt;
#&lt;DESCRIBED-STANDARD-CLASS PERSON&gt;

(display t (make-instance 'person))
=&gt;
First name:#&lt;UNBOUND&gt;
Last name:#&lt;UNBOUND&gt;
Company name:#&lt;UNBOUND&gt;
Date of birth:#&lt;UNBOUND&gt;
Phone:#&lt;UNBOUND&gt;
Fax:#&lt;UNBOUND&gt;
Email:#&lt;UNBOUND&gt;
Address:#&lt;UNBOUND&gt;
City:#&lt;UNBOUND&gt;
Province:#&lt;UNBOUND&gt;
Postal code:#&lt;UNBOUND&gt;

</pre>



</div>

<div id="outline-container-6.1" class="outline-3">
<h3 id="sec-6.1">6.1 Described CLOS objects an the EDITABLE description</h3>
<div id="text-6.1">


<p>
The slots of an object are SETF'able places, and LoL takes
advantage of that to provide EDITABLE descriptions
automatically. When the EDITABLE description is active, and editor
will be presented. The REPL based editor is pretty basic, but still
useful. The HTML based editor will be described later.
</p>



<pre class="src">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">edit-object</span> (object <span style="color: #228b22;">&amp;rest</span> args)
  (<span style="color: #a020f0;">with-active-descriptions</span> (editable)
    (apply #'display t object args)))

(<span style="color: #a020f0;">let</span> ((object (make-instance 'person)))
  (edit-object object)
  (terpri)
  (display t object))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">What follows are prompts and the information i entered
</span>       
First name:Drew

Last name:Crampsie

Company name:The Tech Co-op

Date of birth:1978-07-31

Phone:555-5555

Fax:555-5555

Email:drewc@tech.coop

Address:s/v Kanu, Lower Fraser River

City:Richmond

Province:BC

Postal code:V1V3T6

<span style="color: #b22222;">;; </span><span style="color: #b22222;">And this is what was displayed.
</span>
First name:Drew
Last name:Crampsie
Company name:The Tech Co-op
Date of birth:1978-07-31
Phone:555-5555
Fax:555-5555
Email:drewc@tech.coop
Address:s/v Kanu, Lower Fraser River
City:Richmond
Province:BC
Postal code:V1V3T6
</pre>


</div>

</div>

<div id="outline-container-6.2" class="outline-3">
<h3 id="sec-6.2">6.2 Extending the generated description</h3>
<div id="text-6.2">


<p>
We mentioned earlier that DESCRIBED-CLASS creates two descriptions :
</p>


<pre class="src">
(find-description 'description-for-person)
=&gt;
#&lt;DESCRIPTION DESCRIPTION-FOR-PERSON {D296DE1}&gt;

(find-description 'person)
=&gt;
#&lt;DESCRIPTION PERSON {ADFEDB1}&gt;

(description-of (make-instance 'person))
=&gt;
#&lt;DESCRIPTION PERSON {ADFEDB1}&gt;

</pre>



<p>
The reason for this is so we can redefine the description PERSON while
keeping all the generated information from DESCRIPTION-FOR-PERSON.
</p>
<p>
In this case, we will  add an attribute, PERSON-AGE, that calculates
a persons age based on the data in the date-of-birth slot.
</p>












</div>
</div>

</div>
